# -*- coding: utf-8 -*-
#coding=utf-8 
print('yibh 的Python程序测试!!!\n')
#print(input(r'我是测试转移字符的\\`""' "嘿,来输入一个加减乘除,就可以得到结果:\n"),'Hello World!!!')

#print('''测试1
#测试2
#测试3''') #测试 '''...'''(说明:这在命令行里)格式表示多行,程序里''' 这是内容可以用回车换行 ''',换行


#多行注释用三个双引号"或者'包裹起来 ,经过测试三个'注释里面不能包含3个'(下面第一个)

"""
''' #多行注释 ,这个是错误的
print(r'''"测试1"
测试2
测试3''')
'''
"""

''' #多行注释
测试1
测试2
测试3
'''

""" #多行注释
print(r'''"测试1"
测试2
测试3''')
"""

'''
print('测试1测试2测试3')
print("测试1测试2测试3")
'''

'''
#貌似输入默认是String类型,需要转换一下比较
a=input('输入一个数字,比8大吗?\n')
b=int(a)
print('输入值=',b)
if 8>b:
	print(8<b)
else :
	print(8<b)
'''

'''
#除法 /结果是浮点型 //两个除数是整数,结果也是整数,貌似不要小数点后的值,虽然有小数点
print('11/3=',11/3)
print('11//3=',11//3)
print('11.0//3.0=',11.0//3.0)
print('11.1//3.3=',11.1//3.3)
'''

#print (u'测试中文')


#格式化
print('%03d哈哈%02d编号,占比%.1f%%'%(3,1,5.6))
print('%.2f'%5.6789999) #取小数点后2位,会四舍五入
print('%s是个好人!'%'yibh')
print('成绩相对去年提升了%.1f%%'%((1)/72*100))

